sihjiaqi/ameba-rtos-pro2/component/video/driver/RTL8735B/video_boot.c
/******************************************************************************
*
* Copyright(c) 2021 - 2025 Realtek Corporation. All rights reserved.
*
******************************************************************************/

#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include "platform_stdlib.h"
#include "hal_video.h"
#include "hal_voe.h"
#include "video_boot.h"
#include "diag.h"
#include "rtl8735b_i2c.h"
extern uint8_t __eram_end__[];
extern uint8_t __eram_start__[];
extern int __voe_code_start__[];
static int fcs_flag = 0;//for disable fcs flag
extern video_boot_stream_t video_boot_stream;
static unsigned char video_boot_slot_num[5] = {2, 2, 2, 2, 2};

_WEAK int video_boot_init_sensor_config(void)
{
	return -1;
}

_WEAK int user_load_sensor_boot(void)
{
	return 0;//default not to use
}

extern hal_status_t hal_voe_i2c_init_btldr(u8 idx);
extern void hal_voe_set_kmfw_base_addr(u32 val);
extern void hal_voe_set_kmfw_len(u32 val);
int video_btldr_init_sensor_process(void)
{
	int ret = 0;
	hal_i2c_adapter_t  i2c_master_btldr;
	u8 i2c_idx = 0xff;
	ret = user_load_sensor_boot();
	if (ret <= 0) {
		dbg_printf("It don't do the sensor initial process\r\n");
		return -1;
	} else {
		//dbg_printf("Do the sensor initial process\r\n");
	}

	i2c_master_btldr.pltf_dat.scl_pin = PIN_D12;
	i2c_master_btldr.pltf_dat.sda_pin = PIN_D10;
	i2c_master_btldr.init_dat.index = 3;
	//i2c_slave_addr = 0x30;
	i2c_idx = 3;
	//i2c_addr_len = 2;
	//i2c_data_len = 1;

	hal_i2c_pin_unregister_simple(&i2c_master_btldr);
	hal_i2c_pin_register_simple(&i2c_master_btldr);
	ret = hal_voe_i2c_init_btldr(i2c_idx);
	if (ret != HAL_OK) {
		dbg_printf("hal_voe_i2c_init_btldr fail: %x\n\r", ret);
		hal_i2c_pin_unregister_simple(&i2c_master_btldr);
		return -1;
	} else {
		//dbg_printf("hal_voe_i2c_init_btldr Success\n\r");
	}
	ret = video_boot_init_sensor_config();
	if (ret != 0) {
		dbg_printf("video_boot_init_sensor_config fail\r\n");
		hal_i2c_pin_unregister_simple(&i2c_master_btldr);
	} else {
		//dbg_printf("video_boot_init_sensor_config ok\r\n");
		hal_voe_set_kmfw_base_addr(FCS_RUN_DATA_OK_KM); //set fcs status OK
		hal_voe_set_kmfw_len(0); //clear fcs error_code
	}
	return ret;
}

void video_boot_setup_slot_num(int stream_id, int slot_number)
{
	if ((stream_id >= 0 && stream_id <= 4) && (slot_number >= 2 && slot_number <= 3)) {
		video_boot_slot_num[stream_id] = slot_number;
	} else {
		dbg_printf("The slot number don't support %d %d\r\n", stream_id, slot_number);
	}
}

//Note that heap_4_2.c needs block header (size 0x20) for each block
#define xHeapStructSize 0x20
unsigned int video_boot_malloc(unsigned int size) // alignment 32 byte
{
	unsigned int heap_size = 0;
	unsigned int heap_addr = 0;
	if (size % 32 == 0) {
		heap_size = size;
	} else {
		heap_size = size + (32 - (size % 32));
	}
	//printf("__eram_end__ %x - __eram_start__ %x\r\n",__eram_end__,__eram_start__);
	// allocate the video memory in the end of the heap
	// reverse heapstruct size for the setting of the freertos heap system
	heap_addr = (unsigned int)__eram_end__ - xHeapStructSize - heap_size;
	//printf("heap_addr %x  size %d\r\n", heap_addr, heap_size);
	return heap_addr;
}

void video_boot_set_private_mask(int ch, video_boot_private_mask_t *pmask)
{
	hal_video_reset_mask_status();
	hal_video_set_mask_color(0xff0080);
	for (int id = 0 ; id < PRIVATE_MAX_NUM; id++) {
		if (id == PRIVATE_MASK_GRID) { //GRID MODE
			isp_grid_t grid;
			dbg_printf("[GRID Mode]:\r\n");
			if (pmask->start_x[id] % 2) {
				dbg_printf("[%s] invalid value pmask->start_x=%d", __FUNCTION__, pmask->start_x);
				continue;
			}
			if (pmask->start_y[id] % 2) {
				dbg_printf("[%s] invalid value pmask->start_y=%d", __FUNCTION__, pmask->start_y);
				continue;
			}
			if (pmask->cols % 8) {
				dbg_printf("[%s] invalid value pmask->cols=%d", __FUNCTION__, pmask->cols);
				continue;
			}
			if (pmask->w[id] % 16) {
				int cell_w = pmask->w[id] / pmask->cols;
				if (cell_w % 2) {
					dbg_printf("[%s] invalid value cell_w=%d", __FUNCTION__, cell_w);
					continue;
				}
			}

			if (pmask->en[id] && pmask->cols > 0 && pmask->rows > 0) {
				grid.start_x = pmask->start_x[id];
				grid.start_y = pmask->start_y[id];
				grid.cols = pmask->cols;
				grid.rows = pmask->rows;
				grid.cell_w = pmask->w[id] / grid.cols;
				grid.cell_h = pmask->h[id] / grid.rows;
			}
			hal_video_config_grid_mask(pmask->en[id], grid, (uint8_t *)pmask->bitmap);
		} else { //RECT MODE
			isp_rect_t rect;
			if (pmask->start_x[id] % 2) {
				dbg_printf("[%s] invalid value pmask->start_x=%d", __FUNCTION__, pmask->start_x);
				continue;
			}
			if (pmask->start_y[id] % 2) {
				dbg_printf("[%s] invalid value pmask->start_y=%d", __FUNCTION__, pmask->start_y);
				continue;
			}
			rect.left = pmask->start_x[id];
			rect.top  = pmask->start_y[id];
			rect.right  = pmask->w[id] + rect.left;
			rect.bottom = pmask->h[id] + rect.top;
			hal_video_config_rect_mask(pmask->en[id], id - 1, rect);
		}
	}
	hal_video_fast_enable_mask(ch);
}

int video_boot_buf_calc(video_boot_stream_t vidoe_boot)
{
	int v3dnr_w = 2560;
	int v3dnr_h = 1440;
	int enc_buf_size_len = 0;
	int enc_buf_size = 0;
	int i = 0;

	if (vidoe_boot.isp_info.sensor_width && vidoe_boot.isp_info.sensor_height) {
		v3dnr_w = vidoe_boot.isp_info.sensor_width;
		v3dnr_h = vidoe_boot.isp_info.sensor_height;
	}
	//printf("v3dnr_w %d v3dnr_h %d\r\n", v3dnr_w, v3dnr_h);
	vidoe_boot.voe_heap_size += ((v3dnr_w * v3dnr_h * 3) / 2);

	if (vidoe_boot.isp_info.md_enable) {
		if (vidoe_boot.isp_info.md_buf_size) {
			vidoe_boot.voe_heap_size += vidoe_boot.isp_info.md_buf_size;
		} else {
			vidoe_boot.voe_heap_size += ENABLE_MD_BUF;
		}
	}

	if (vidoe_boot.isp_info.hdr_enable) {
		vidoe_boot.voe_heap_size += ENABLE_HDR_BUF;
	}

	for (i = 0; i < 3; i++) {
		if (vidoe_boot.video_enable[i]) {
			vidoe_boot.voe_heap_size += ((vidoe_boot.video_params[i].width * vidoe_boot.video_params[i].height * 3) / 2) * video_boot_slot_num[i];
			//ISP common
			vidoe_boot.voe_heap_size += ISP_CREATE_BUF;
			//enc ref
			vidoe_boot.voe_heap_size += ((vidoe_boot.video_params[i].width * vidoe_boot.video_params[i].height * 3) / 2) * 2 +
										(vidoe_boot.video_params[i].width * vidoe_boot.video_params[i].height / 16) * 2;
			//enc common
			vidoe_boot.voe_heap_size += ENC_CREATE_BUF;
			//enc buffer
			if (i == 0) {
				enc_buf_size_len = V1_ENC_BUF_SIZE;
			} else if (i == 1) {
				enc_buf_size_len = V2_ENC_BUF_SIZE;
			} else if (i == 2) {
				enc_buf_size_len = V3_ENC_BUF_SIZE;
			}
			enc_buf_size = ((vidoe_boot.video_params[i].width * vidoe_boot.video_params[i].height) / VIDEO_RSVD_DIVISION + (vidoe_boot.video_params[i].bps *
							enc_buf_size_len) / 8);
			vidoe_boot.voe_heap_size += enc_buf_size;
			video_boot_stream.video_params[i].out_buf_size = enc_buf_size;
			//dbg_printf("channel %d size %d\r\n",i,video_boot_stream.video_params[i].out_buf_size);
			//shapshot
			if (vidoe_boot.video_snapshot[i]) {
				vidoe_boot.voe_heap_size += ((vidoe_boot.video_params[i].width * vidoe_boot.video_params[i].height * 3) / 2) + SNAPSHOT_BUF;
			}
			//osd common
			if (vidoe_boot.isp_info.osd_enable) {
				vidoe_boot.voe_heap_size += OSD_CREATE_BUF;
			}
		}
	}
	if (vidoe_boot.video_enable[STREAM_V4]) { //For NN memory
		//ISP buffer
		vidoe_boot.voe_heap_size += vidoe_boot.video_params[i].width * vidoe_boot.video_params[STREAM_V4].height * 3 * video_boot_slot_num[STREAM_ID_V4];
		//ISP common
		vidoe_boot.voe_heap_size += ISP_CREATE_BUF;
	}
	if (vidoe_boot.voe_heap_size % 32 == 0) {
		vidoe_boot.voe_heap_size = vidoe_boot.voe_heap_size;
	} else {
		vidoe_boot.voe_heap_size = vidoe_boot.voe_heap_size + (32 - (vidoe_boot.voe_heap_size % 32));
	}

	return vidoe_boot.voe_heap_size;
}

void video_boot_calcu_meta_size(unsigned int *fcs_meta_size, unsigned int *fcs_meta_extend_size)
{
	int meta_size = 0;
	int meta_loop = 0;
	int enable_extend = 0;
	if (video_boot_stream.extra_fcs_meta_enable_extend) {
		meta_loop = 2;
	} else {
		meta_loop = 1;
	}
	for (int i = 0; i < meta_loop; i++) {
		if (i == 1 && video_boot_stream.extra_fcs_meta_enable_extend) {
			enable_extend = 1;//Insert the extend meta size
		}
		if (enable_extend) {
			meta_size = video_boot_stream.meta_size + sizeof(isp_meta_t) + sizeof(isp_statis_meta_t) + sizeof(af_statis_t) + sizeof(ae_statis_t) + sizeof(awb_statis_t);
		} else {
			meta_size = video_boot_stream.meta_size + sizeof(isp_meta_t) + sizeof(isp_statis_meta_t);
		}
		meta_size = meta_size + meta_size / 2; //Add the extra buffer to dummy bytes
		if (meta_size % 32) { //align 32 byte
			meta_size = meta_size + (32 - (meta_size % 32));
		}
		if (enable_extend) {
			video_boot_stream.extra_fcs_meta_extend_offset = meta_size / 0xff;
			video_boot_stream.extra_fcs_meta_extend_total_size = meta_size;
			if (video_boot_stream.extra_fcs_meta_extend_total_size > VIDEO_BOOT_META_REV_BUF) {
				dbg_printf("Meta size %d is exceed the sei buffer %d\r\n", meta_size, VIDEO_BOOT_META_REV_BUF);
				video_boot_stream.extra_fcs_meta_extend_total_size = VIDEO_BOOT_META_REV_BUF;
				//v_adp->cmd[ch]->userData = VIDEO_BOOT_META_REV_BUF;
				dbg_printf("Setup the meta size as %d\r\n", VIDEO_BOOT_META_REV_BUF);
			}
		} else {
			video_boot_stream.fcs_meta_offset = meta_size / 0xff;
			video_boot_stream.fcs_meta_total_size = meta_size;
			if (video_boot_stream.fcs_meta_total_size > VIDEO_BOOT_META_REV_BUF) {
				dbg_printf("Meta size %d is exceed the sei buffer %d\r\n", meta_size, VIDEO_BOOT_META_REV_BUF);
				video_boot_stream.fcs_meta_total_size = VIDEO_BOOT_META_REV_BUF;
				//v_adp->cmd[ch]->userData = VIDEO_BOOT_META_REV_BUF;
				dbg_printf("Setup the meta size as %d\r\n", VIDEO_BOOT_META_REV_BUF);
			}
		}
	}
	*fcs_meta_size = video_boot_stream.fcs_meta_total_size;
	*fcs_meta_extend_size = video_boot_stream.extra_fcs_meta_extend_total_size;
}

int video_boot_open(int ch_index, video_boot_params_t *v_stream)
{
	int ch = v_stream->stream_id;
	int fcs_v = v_stream->fcs;
	int isp_fps = video_boot_stream.isp_info.sensor_fps;
	int fps = 30;
	int gop = 30;
	int rcMode = 1;
	int bps = 2 * 1024 * 1024;
	int minQp = 0;
	int maxQp = 51;
	int rotation = 0;
	int jpeg_qlevel = 5;
	int type;
	int res = 0;
	int codec = 0;

