sihjiaqi/ameba-rtos-pro2/component/video/driver/RTL8735B/video_boot.c
	int enc_in_w = (video_boot_stream.video_params[ch_index].width + 15) & ~15;  //force 16 aligned
	int enc_in_h = video_boot_stream.video_params[ch_index].height;
	int enc_out_w = video_boot_stream.video_params[ch_index].width;  //will crop enc_in_w to enc_out_w
	int enc_out_h = video_boot_stream.video_params[ch_index].height;
	int enc_out_w_offset = (enc_in_w - enc_out_w) / 2;

	int out_rsvd_size = (enc_in_w * enc_in_h) / VIDEO_RSVD_DIVISION;
	int out_buf_size = 0;
	int jpeg_out_buf_size = out_rsvd_size * 3;
	switch (ch) {
	case 0:
		out_buf_size = (v_stream->bps * V1_ENC_BUF_SIZE) / 8 + out_rsvd_size;
		break;
	case 1:
		out_buf_size = (v_stream->bps * V2_ENC_BUF_SIZE) / 8 + out_rsvd_size;
		break;
	case 2:
		out_buf_size = (v_stream->bps * V3_ENC_BUF_SIZE) / 8 + out_rsvd_size;
		break;
	}

	bps = video_boot_stream.video_params[ch_index].bps;

	if (video_boot_stream.video_params[ch_index].rc_mode) {
		rcMode = video_boot_stream.video_params[ch_index].rc_mode - 1;
		if (rcMode) {
			minQp = 25;
			maxQp = 48;
			bps = video_boot_stream.video_params[ch_index].bps / 2;
		}
	}

	if (video_boot_stream.video_params[ch_index].minQp > 0 && video_boot_stream.video_params[ch_index].minQp <= 51) {
		minQp = video_boot_stream.video_params[ch_index].minQp;
	}
	if (video_boot_stream.video_params[ch_index].maxQp > 0 && video_boot_stream.video_params[ch_index].maxQp <= 51) {
		maxQp = video_boot_stream.video_params[ch_index].maxQp;
	}

	hal_video_adapter_t *v_adp = hal_video_get_adp();
	v_adp->cmd[ch]->lumWidthSrc = enc_in_w;
	v_adp->cmd[ch]->lumHeightSrc = enc_in_h;
	v_adp->cmd[ch]->width = enc_out_w;
	v_adp->cmd[ch]->height = enc_out_h;
	v_adp->cmd[ch]->horOffsetSrc = enc_out_w_offset;
	v_adp->cmd[ch]->rotation = video_boot_stream.video_params[ch_index].rotation;
	v_adp->cmd[ch]->bitPerSecond = bps;//video_boot_stream.video_params[ch].bps;
	v_adp->cmd[ch]->qpMin = minQp;
	v_adp->cmd[ch]->qpMax = maxQp;

	v_adp->cmd[ch]->vbr = rcMode;

	v_adp->cmd[ch]->CodecType = v_stream->type;
	v_adp->cmd[ch]->fcs = 1;
	v_adp->cmd[ch]->EncMode = MODE_QUEUE;

	if (v_stream->type == CODEC_HEVC) {
		v_adp->cmd[ch]->outputFormat     = VCENC_VIDEO_CODEC_HEVC,
						v_adp->cmd[ch]->max_cu_size      = 64;
		v_adp->cmd[ch]->min_cu_size      = 8;
		v_adp->cmd[ch]->max_tr_size      = 16;
		v_adp->cmd[ch]->min_tr_size      = 4;
		v_adp->cmd[ch]->tr_depth_intra   = 2; 							 //mfu =>0
		v_adp->cmd[ch]->tr_depth_inter   = 4;							// (.max_cu_size == 64) ? 4 : 3,
		v_adp->cmd[ch]->level            = VCENC_HEVC_LEVEL_6;
		v_adp->cmd[ch]->profile          = VCENC_HEVC_MAIN_PROFILE;	// default is HEVC MAIN profile
		v_adp->cmd[ch]->outputRateNumer = v_stream->fps;
		v_adp->cmd[ch]->inputRateNumer = isp_fps;
		v_adp->cmd[ch]->intraPicRate = v_stream->gop;
	} else if (v_stream->type == CODEC_NV12) {
		v_adp->cmd[ch]->EncMode = 0;
		v_adp->cmd[ch]->outputFormat     = VCENC_VIDEO_CODEC_NV12;
		v_adp->cmd[ch]->YuvMode 		 = MODE_QUEUE;
		v_adp->cmd[ch]->inputRateNumer = v_stream->fps;
	} else if (v_stream->type == CODEC_RGB) {
		v_adp->cmd[ch]->EncMode = 0;
		v_adp->cmd[ch]->outputFormat     = VCENC_VIDEO_CODEC_RGB;
		v_adp->cmd[ch]->YuvMode 		 = MODE_QUEUE;
		v_adp->cmd[ch]->inputRateNumer = v_stream->fps;
	} else {
		v_adp->cmd[ch]->outputFormat     = VCENC_VIDEO_CODEC_H264;
		v_adp->cmd[ch]->max_cu_size      = 16;
		v_adp->cmd[ch]->min_cu_size      = 8;
		v_adp->cmd[ch]->max_tr_size      = 16;
		v_adp->cmd[ch]->min_tr_size      = 4;
		v_adp->cmd[ch]->tr_depth_intra   = 1;
		v_adp->cmd[ch]->tr_depth_inter   = 2;
		v_adp->cmd[ch]->level            = VCENC_H264_LEVEL_5_1;
		v_adp->cmd[ch]->profile          = VCENC_H264_HIGH_PROFILE;	// default is HEVC HIGH profile
		v_adp->cmd[ch]->outputRateNumer = v_stream->fps;
		v_adp->cmd[ch]->inputRateNumer = isp_fps;
		v_adp->cmd[ch]->intraPicRate = v_stream->gop;
	}
	v_adp->cmd[ch]->byteStream = VCENC_BYTE_STREAM;
	v_adp->cmd[ch]->ch = v_stream->stream_id;
	if (video_boot_stream.isp_info.osd_enable) {
		v_adp->cmd[ch]->osd = 1;
	}

	if (video_boot_stream.video_snapshot[ch_index]) {
		v_adp->cmd[ch]->CodecType = v_stream->type | CODEC_JPEG;
		v_adp->cmd[ch]->JpegMode = MODE_SNAPSHOT;
		//Disable the ring buffer with JPEG SNAPSHOT. Setup the jpg_buf_size and jpg_rsvd_size as the same size
		v_adp->cmd[ch]->jpg_buf_size = v_stream->width * v_stream->height * 3 / 2;
		v_adp->cmd[ch]->jpg_rsvd_size = v_stream->width * v_stream->height * 3 / 2;
		v_adp->cmd[ch]->qLevel = v_stream->jpeg_qlevel;
	}

	if (video_boot_stream.fcs_channel == 1 && ch != 0) { //Disable the fcs for channel 1
		v_adp->cmd[0]->fcs = 0;//Remove the fcs setup for channel one
		dcache_clean_invalidate_by_addr((uint32_t *)v_adp->cmd[0], sizeof(commandLine_s));
	}
	v_adp->cmd[ch]->out_buf_size  = out_buf_size;
	v_adp->cmd[ch]->out_rsvd_size = out_rsvd_size;
	v_adp->cmd[ch]->isp_buf_num = video_boot_slot_num[ch];

	v_adp->cmd[ch]->direct_i2c_mode = 1;
	if (video_boot_stream.fcs_isp_ae_enable) {
		v_adp->cmd[ch]->set_AE_init_flag = 1;
		v_adp->cmd[ch]->all_init_iq_set_flag = 1;
		v_adp->cmd[ch]->init_exposure = video_boot_stream.fcs_isp_ae_init_exposure;
		v_adp->cmd[ch]->init_gain = video_boot_stream.fcs_isp_ae_init_gain;
	}
	if (video_boot_stream.fcs_isp_awb_enable) {
		v_adp->cmd[ch]->set_AWB_init_flag = 1;
		v_adp->cmd[ch]->all_init_iq_set_flag = 1;
		v_adp->cmd[ch]->init_r_gain = video_boot_stream.fcs_isp_awb_init_rgain;
		v_adp->cmd[ch]->init_b_gain = video_boot_stream.fcs_isp_awb_init_bgain;
	}

	if (video_boot_stream.fcs_isp_init_daynight_mode) {
		v_adp->cmd[ch]->all_init_iq_set_flag = 1;
		v_adp->cmd[ch]->init_daynight_mode = video_boot_stream.fcs_isp_init_daynight_mode;
	}

	if (video_boot_stream.fcs_isp_gray_mode) {
		v_adp->cmd[ch]->all_init_iq_set_flag = 1;
		v_adp->cmd[ch]->gray_mode = video_boot_stream.fcs_isp_gray_mode;
	}

	if (video_boot_stream.video_drop_frame[ch_index]) {
		v_adp->cmd[ch]->all_init_iq_set_flag = 1;
		v_adp->cmd[ch]->drop_frame_num = video_boot_stream.video_drop_frame[ch_index];
	}

	if (v_stream->use_roi) {
		v_adp->cmd[ch]->roix = v_stream->roi.xmin;
		v_adp->cmd[ch]->roiy = v_stream->roi.ymin;
		v_adp->cmd[ch]->roiw = v_stream->roi.xmax - v_stream->roi.xmin;
		v_adp->cmd[ch]->roih = v_stream->roi.ymax - v_stream->roi.ymin;
	}

