sihjiaqi/ameba-rtos-pro2/component/video/driver/RTL8735B/video_boot.c
	if (v_stream->level) {
		v_adp->cmd[ch]->level = v_stream->level;
	}
	if (v_stream->profile) {
		v_adp->cmd[ch]->profile = v_stream->profile;
	}
	if (v_stream->cavlc) {
		v_adp->cmd[ch]->enableCabac = 0;
	}

	if (video_boot_stream.private_mask.enable) {
		video_boot_set_private_mask(ch, &video_boot_stream.private_mask);
	}
	if (video_boot_stream.meta_enable) {
#if 0
		int meta_size = video_boot_stream.meta_size + sizeof(isp_meta_t) + sizeof(isp_statis_meta_t);

		meta_size = meta_size + meta_size / 4; //Add the extra buffer to dummy bytes
		if (meta_size % 32) { //align 32 byte
			meta_size = meta_size + (32 - (meta_size % 32));
		}
		video_boot_stream.fcs_meta_offset = meta_size / 0xff;
		video_boot_stream.fcs_meta_total_size = meta_size;
		v_adp->cmd[ch]->isp_meta_out = 1;
		v_adp->cmd[ch]->EncuserData = meta_size;
		v_adp->cmd[ch]->IDRuserData = meta_size;
		v_adp->cmd[ch]->IDRuserDataDuration = 1;
#else
		unsigned int fcs_meta_size;
		unsigned int fcs_meta_extend_size;
		video_boot_calcu_meta_size(&fcs_meta_size, &fcs_meta_extend_size);
		v_adp->cmd[ch]->isp_meta_out = 1;
		v_adp->cmd[ch]->EncuserData = fcs_meta_size;
		if (video_boot_stream.extra_fcs_meta_enable_extend) {
			v_adp->cmd[ch]->IDRuserData = fcs_meta_extend_size;
		} else {
			v_adp->cmd[ch]->EncuserData = fcs_meta_size;
		}
		v_adp->cmd[ch]->IDRuserDataDuration = 1;
#endif
		if (video_boot_stream.video_snapshot[ch_index]) {
			v_adp->cmd[ch]->JPGuserData = video_boot_stream.fcs_meta_total_size;
		}
		if (v_adp->cmd[ch]->EncuserData > VIDEO_BOOT_META_REV_BUF) {
			dbg_printf("Meta size %d is exceed the sei buffer %d\r\n", v_adp->cmd[ch]->EncuserData, VIDEO_BOOT_META_REV_BUF);
			v_adp->cmd[ch]->EncuserData = VIDEO_BOOT_META_REV_BUF;
			dbg_printf("Setup the meta size as %d\r\n", VIDEO_BOOT_META_REV_BUF);
		}
	}
	if (video_boot_stream.init_isp_items.enable) {
		video_isp_initial_items_t init_items;
		v_adp->cmd[ch]->all_init_iq_set_flag = 1;
		init_items.init_brightness = video_boot_stream.init_isp_items.init_brightness;
		init_items.init_contrast = video_boot_stream.init_isp_items.init_contrast;
		init_items.init_flicker = video_boot_stream.init_isp_items.init_flicker;
		init_items.init_hdr_mode = video_boot_stream.init_isp_items.init_hdr_mode;;
		init_items.init_mirrorflip = video_boot_stream.init_isp_items.init_mirrorflip;
		init_items.init_saturation = video_boot_stream.init_isp_items.init_saturation;
		init_items.init_wdr_level = video_boot_stream.init_isp_items.init_wdr_level;
		init_items.init_wdr_mode = video_boot_stream.init_isp_items.init_wdr_mode;
		init_items.init_mipi_mode = video_boot_stream.init_isp_items.init_mipi_mode;
		hal_video_set_isp_init_items(ch, &init_items);
	} else {
		video_isp_initial_items_t init_items;
		init_items.init_brightness = 0xffff;
		init_items.init_contrast = 0xffff;
		init_items.init_flicker = 0xffff;
		init_items.init_hdr_mode = 0xffff;
		init_items.init_mirrorflip = 0xffff;
		init_items.init_saturation = 0xffff;
		init_items.init_wdr_level = 0xffff;
		init_items.init_wdr_mode = 0xffff;
		init_items.init_mipi_mode = 0xffff;
		hal_video_set_isp_init_items(ch, &init_items);
	}

	if (v_stream->fcs_vui_disable) {
		v_adp->cmd[ch]->vui_timing_info_enable = 0;
	}

	/* encoder option should br aligned with paramter_table[] in video_api.c */
	if (v_stream->type == CODEC_HEVC || v_stream->type == CODEC_H264) {
		v_adp->cmd[ch]->gopSize = 1;
		v_adp->cmd[ch]->picRc = 1;
		v_adp->cmd[ch]->ctbRc = 1;
		v_adp->cmd[ch]->qpHdr = -1;
		v_adp->cmd[ch]->intraQpDelta = -5;
		v_adp->cmd[ch]->smoothPsnrInGOP = 1;
		v_adp->cmd[ch]->rcQpDeltaRange = 15;
		v_adp->cmd[ch]->picQpDeltaMin = -4;
		v_adp->cmd[ch]->picQpDeltaMax = 6;
		v_adp->cmd[ch]->blockRCSize = 1;
		v_adp->cmd[ch]->compressor = 3; /* enable both luma and chroma compression to save DDR bandwidth */
	}

	dcache_clean_invalidate_by_addr((uint32_t *)v_adp->cmd[ch], sizeof(commandLine_s));

	//v_stream->out_buf_size = out_buf_size;
	//v_stream->out_rsvd_size = out_rsvd_size;
	return OK;
}

/*** KM BOOT LOADER handling ***/
#define WAIT_FCS_DONE_TIMEOUT 	1000000

_WEAK void user_boot_config_init(void *parm)
{

}

_WEAK int user_disable_fcs(void)
{
	return 0;//default not to use
}

static void set_fcs_boottime_information(void)
{
	video_boot_stream.fcs_start_time = hal_read_cur_time() / 1000; // get the time from booloader to fcs OK
	(* ((volatile uint32_t *) 0xe000edfc)) |= (1 << 24);    // DEMCR, bit 24 TRCENA
	(* ((volatile uint32_t *) 0xe0001004)) = 0;             // DWT_CYCCNT
	(* ((volatile uint32_t *) 0xe0001000)) |= 1;            // DWT_CTRL, bit 0 CYCCNTENA
}

extern uint8_t bl4voe_shared_test[];
int video_btldr_process(voe_fcs_load_ctrl_t *pvoe_fcs_ld_ctrl, int *code_start)
{
	int ret = OK;
	unsigned int addr = 0;
	uint8_t *p_fcs_data = NULL, *p_iq_data = NULL, *p_sensor_data = NULL;
	uint8_t fcs_id;
	voe_cpy_t isp_cpy = NULL;
	isp_multi_fcs_ld_info_t *p_fcs_ld_info = NULL;
	int i = 0;
	int video_boot_struct_size = 0;

	if (NULL == pvoe_fcs_ld_ctrl) {
		dbg_printf("voe FCS ld ctrl is NULL \n");
		ret = FCS_CPY_FUNC_ERR;
		return ret;
	} else {
		isp_cpy       = pvoe_fcs_ld_ctrl->isp_cpy;
		p_fcs_ld_info = pvoe_fcs_ld_ctrl->p_fcs_ld_info;
	}

	fcs_id = p_fcs_ld_info->fcs_id;
	p_fcs_data    = (uint8_t *)((p_fcs_ld_info->fcs_hdr_start) + (p_fcs_ld_info->sensor_set[fcs_id].fcs_data_offset));
	p_iq_data     = (uint8_t *)(p_fcs_data + (p_fcs_ld_info->sensor_set[fcs_id].iq_start_addr));
	p_sensor_data = (uint8_t *)(p_fcs_data + (p_fcs_ld_info->sensor_set[fcs_id].sensor_start_addr));
	// this api is use to keep the boot time information
	set_fcs_boottime_information();
	if (hal_voe_fcs_check_OK()) {
		user_boot_config_init(pvoe_fcs_ld_ctrl->p_fcs_para_raw);
		if ((video_boot_stream.fcs_isp_iq_id != 0) && (video_boot_stream.fcs_isp_iq_id < p_fcs_ld_info->multi_fcs_cnt)) {
			p_fcs_data    = (uint8_t *)((p_fcs_ld_info->fcs_hdr_start) + (p_fcs_ld_info->sensor_set[video_boot_stream.fcs_isp_iq_id].fcs_data_offset));
			p_iq_data     = (uint8_t *)(p_fcs_data + (p_fcs_ld_info->sensor_set[video_boot_stream.fcs_isp_iq_id].iq_start_addr));
			p_sensor_data = (uint8_t *)(p_fcs_data + (p_fcs_ld_info->sensor_set[video_boot_stream.fcs_isp_iq_id].sensor_start_addr));
		}
		hal_video_load_iq((voe_cpy_t)isp_cpy, (int *) p_iq_data, (int *) __voe_code_start__);
		hal_video_load_sensor((voe_cpy_t)isp_cpy, (int *) p_sensor_data, (int *) __voe_code_start__);
		int fcs_ch = -1;
		for (i = 0; i < MAX_FCS_CHANNEL; i++) {
			if (video_boot_stream.video_params[i].fcs) {
				video_boot_open(i, &video_boot_stream.video_params[i]);
			}
			if ((fcs_ch == -1) && (video_boot_stream.video_params[i].fcs == 1)) { //Get the first start channel
				fcs_ch = i;
			}
		}
		__DSB();

		pvoe_fcs_peri_info_t fcs_peri_info_for_ram = pvoe_fcs_ld_ctrl->p_fcs_peri_info;


		if (fcs_peri_info_for_ram->i2c_id <= 3) {
			hal_video_isp_set_i2c_id(fcs_ch, fcs_peri_info_for_ram->i2c_id);
		}

		if (fcs_peri_info_for_ram->fcs_data_verion == 0x1) {
			if (fcs_peri_info_for_ram->gpio_cnt > 3) {
				hal_video_isp_set_sensor_gpio(fcs_ch, fcs_peri_info_for_ram->gpio_list[3], fcs_peri_info_for_ram->gpio_list[2], fcs_peri_info_for_ram->gpio_list[0]);
				hal_pinmux_unregister(fcs_peri_info_for_ram->gpio_list[1], PID_GPIO);
				//dbg_printf("snr_pwr 0x%02x pwdn 0x%02x rst 0x%02x i2c_id %d \n", fcs_peri_info_for_ram->gpio_list[0], fcs_peri_info_for_ram->gpio_list[2], fcs_peri_info_for_ram->gpio_list[3], fcs_peri_info_for_ram->i2c_id);
			}
		} else {
			if (fcs_peri_info_for_ram->gpio_cnt > 2) {
				hal_video_isp_set_sensor_gpio(fcs_ch, fcs_peri_info_for_ram->gpio_list[1], fcs_peri_info_for_ram->gpio_list[2], fcs_peri_info_for_ram->gpio_list[0]);
				//dbg_printf("snr_pwr 0x%02x pwdn 0x%02x rst 0x%02x i2c_id %d \n", fcs_peri_info_for_ram->gpio_list[0], fcs_peri_info_for_ram->gpio_list[2], fcs_peri_info_for_ram->gpio_list[1], fcs_peri_info_for_ram->i2c_id);

