sihjiaqi/ameba-rtos-pro2/component/video/driver/RTL8735B/video_boot.c
			}
		}

		int voe_heap_size = video_boot_buf_calc(video_boot_stream);
		addr = video_boot_malloc(voe_heap_size);
		video_boot_stream.voe_heap_addr = addr;
		video_boot_stream.voe_heap_size = voe_heap_size;
		if (video_boot_stream.fcs_start_time) { //Measure the fcs time
			video_boot_stream.fcs_voe_time = (* ((volatile uint32_t *) 0xe0001004)) / (500000) + video_boot_stream.fcs_start_time;
		}
		ret = hal_video_init((long unsigned int *)addr, voe_heap_size);
		video_boot_stream.fcs_status = 1;
	}
	video_boot_stream.fcs_voe_fw_addr = (int)pvoe_fcs_ld_ctrl->fw_addr;
	memcpy(&video_boot_stream.p_fcs_ld_info, p_fcs_ld_info, sizeof(isp_multi_fcs_ld_info_t));
	video_boot_struct_size = sizeof(video_boot_stream_t);
	if (fcs_flag == 1 && video_boot_stream.fcs_status == 0) {
		video_boot_stream.p_fcs_ld_info.fcs_id = 0;
	}
	if (video_boot_struct_size <= VIDEO_BOOT_STRUCT_MAX_SIZE) {
		memcpy(bl4voe_shared_test, &video_boot_stream, sizeof(video_boot_stream_t));
	} else {
		memcpy(bl4voe_shared_test, &video_boot_stream, VIDEO_BOOT_STRUCT_MAX_SIZE);
	}
	return ret;
}
extern void hal_voe_set_kmfw_base_addr(u32 val);
int video_btldr_fcs_terminated(voe_fcs_load_ctrl_t *pvoe_fcs_ld_ctrl)
{

	pvoe_fcs_peri_info_t fcs_peri_info_for_ram = pvoe_fcs_ld_ctrl->p_fcs_peri_info;
	hal_gpio_adapter_t sensor_en_gpio;
	volatile hal_i2c_adapter_t	i2c_master_video;
	hal_status_t ret = 0;

	int terminated_flag = user_disable_fcs();  // Application set terminate or not
	fcs_flag = terminated_flag;

	if (terminated_flag) {
		// disable I2C
		i2c_master_video.pltf_dat.scl_pin = fcs_peri_info_for_ram->i2c_scl;
		i2c_master_video.pltf_dat.sda_pin = fcs_peri_info_for_ram->i2c_sda;
		i2c_master_video.init_dat.index = fcs_peri_info_for_ram->i2c_id;
		ret = hal_i2c_pin_unregister_simple(&i2c_master_video);
		if (ret) {
			dbg_printf("[FCS Terminate] hal_i2c_pin_unregister_simple failed %d \n", ret);
		}

		if (fcs_peri_info_for_ram->gpio_cnt > 0) {

			// unregister pwr_ctrl_pin
			ret = hal_pinmux_unregister(fcs_peri_info_for_ram->gpio_list[0], PID_GPIO);
			if (ret) {
				dbg_printf("[FCS Terminate] hal_pinmux_unregister pwr_ctrl pin failed %d \n", ret);
			} else {
				// turn off sensor power
				ret = hal_gpio_init(&sensor_en_gpio, fcs_peri_info_for_ram->gpio_list[0]);
				if (ret) {
					dbg_printf("[FCS Terminate] hal_gpio_init pwr_ctrl pin failed %d \n", ret);
				} else {
					hal_gpio_set_dir(&sensor_en_gpio, GPIO_OUT);
					hal_gpio_write(&sensor_en_gpio, 0);
					hal_gpio_deinit(&sensor_en_gpio);
				}

			}
			// unregister GPIO
			for (int i = 1;  i < fcs_peri_info_for_ram->gpio_cnt; i++) {
				ret = hal_pinmux_unregister(fcs_peri_info_for_ram->gpio_list[i], PID_GPIO);
				if (ret) {
					dbg_printf("[FCS Terminate] hal_pinmux_unregister GPIO[%d] failed %d \n", i, ret);
				}
			}
			ret = hal_pinmux_unregister(fcs_peri_info_for_ram->snr_clk_pin, PID_SENSOR);
			if (ret) {
				dbg_printf("[FCS Terminate] hal_pinmux_unregister snr_clk_pin failed %d \n", ret);
			}
		}

		fcs_peri_info_for_ram->fcs_OK = 0;
		hal_voe_set_kmfw_base_addr(FCS_RUN_DATA_NG_KM);

	}
	return 0;
}
